// Завдання 3
// 1.Створіть об'єкт car1 з такими властивостями:
// brand: рядок, представляє марку автомобіля.
//     model: рядок, представляє модель автомобіля.
//         year: число, представляє рік випуску автомобіля.
// 1.Створіть об'єкт car2 з такими властивостями:
// brand: рядок, представляє марку автомобіля.
//     model: рядок, представляє модель автомобіля.
//         owner: число, представляє рік випуску автомобіля.
// 1.Створіть об'єкт car3. Використайте оператор spread щоб додати всі властивості що є в car1 та car2 до об’єкту car3.
// 2.Виведіть об'єкт car3 в консоль.

const car1 = {
    brand: 'Volkswagen',
    model: 'Touareg',
    year: 2023
}

const car2 = {
    brand: 'Mercedes',
    model: 'CLE Cabriolet',
    owner: 'Tom Green'
}

const car3 = { ...car1, ...car2 }
console.log(car3)

const car4 = { ...car2, ...car1 } // там, де ключі в обох об'єктів однакові, в результаті застосування оператора spread, в кінцевий об'єкт передаються значення останнього об'єкта. Виходить, що має значення послідовність.
console.log(car4)