//Завдання 2: Конкатенація рядків та шаблонний рядок
//Створіть дві змінні, які містять імена двох осіб. Використовуючи конкатенацію рядків, створіть новий рядок, який містить вітання для обох осіб. Виведіть результат в консоль. Потім використайте шаблонний рядок для створення того ж вітання. Виведіть результат в консоль.

let boy = 'John';
let girl = 'Emily';

let sayHi1 = 'Hello dear ' + boy + ' and ' + girl + '! Nice to see you both!';
console.log(sayHi1);

let sayHi2 = `Hello dear ${boy} and ${girl}! Nice to see you both!`;
console.log(sayHi2);
